ИС_СПОРТ_2022/src/Documents/УстановкаМеждународнойВозрастнойГруппы/УстановкаМеждународнойВозрастнойГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаМеждународнойВозрастнойГруппы</name>
  <registerRecords>InformationRegister.МеждународныеВозрастныеГруппы</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународнаяВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/УстановкаМеждународнойВозрастнойГруппы/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Спортсмен") Тогда
		ТекущийСпортсмен = Параметры.Спортсмен;
		УстановитьОтборПоСпортсменуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И ЗначениеЗаполнено(ТекущийСпортсмен) Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект);
		ОткрытьФорму("Документ.УстановкаМеждународнойВозрастнойГруппы.Форма.ФормаДокумента", Новый Структура("Спортсмен", ТекущийСпортсмен),,,,,Оповещение);
	КонецЕсли;	
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоСпортсменуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спортсмен", ТекущийСпортсмен);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	УстановкаМеждународнойВозрастнойГруппы.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.УстановкаМеждународнойВозрастнойГруппы.Спортсмены КАК УстановкаМеждународнойВозрастнойГруппы
	                |ГДЕ
	                |	УстановкаМеждународнойВозрастнойГруппы.Спортсмен = &Спортсмен";
	массивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", массивДокументов, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(Результат, ДопПараметры) Экспорт
	
	УстановитьОтборПоСпортсменуНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти
